{"reviewerID": "A11N155CW1UV02", "asin": "B000H00VBQ", "reviewerName": "AdrianaM", "helpful": [0, 0], "reviewText": "I had big expectations because I love English TV, in particular Investigative and detective stuff but this guy is really boring. It didn't appeal to me at all.", "overall": 2.0, "summary": "A little bit boring for me", "unixReviewTime": 1399075200, "reviewTime": "05 3, 2014"}
{"reviewerID": "A3BC8O2KCL29V2", "asin": "B000H00VBQ", "reviewerName": "Carol T", "helpful": [0, 0], "reviewText": "I highly recommend this series. It is a must for anyone who is yearning to watch \"grown up\" television. Complex characters and plots to keep one totally involved. Thank you Amazin Prime.", "overall": 5.0, "summary": "Excellent Grown Up TV", "unixReviewTime": 1346630400, "reviewTime": "09 3, 2012"}
{"reviewerID": "A60D5HQFOTSOM", "asin": "B000H00VBQ", "reviewerName": "Daniel Cooper \"dancoopermedia\"", "helpful": [0, 1], "reviewText": "This one is a real snoozer. Don't believe anything you read or hear, it's awful. I had no idea what the title means. Neither will you.", "overall": 1.0, "summary": "Way too boring for me", "unixReviewTime": 1381881600, "reviewTime": "10 16, 2013"}
{"reviewerID": "A1RJPIGRSNX4PW", "asin": "B000H00VBQ", "reviewerName": "J. Kaplan \"JJ\"", "helpful": [0, 0], "reviewText": "Mysteries are interesting.  The tension between Robson and the tall blond is good but not always believable.  She often seemed uncomfortable.", "overall": 4.0, "summary": "Robson Green is mesmerizing", "unixReviewTime": 1383091200, "reviewTime": "10 30, 2013"}
{"reviewerID": "A16XRPF40679KG", "asin": "B000H00VBQ", "reviewerName": "Michael Dobey", "helpful": [1, 1], "reviewText": "This show always is excellent, as far as british crime or mystery showsgoes this is one of the best ever made.  The stories are well done and the acting is top notch with interesting twists in the realistic and brutal storylines.  This show pulls no punches as it enters into the twisted minds of criminals and the profiler psychiatrist who helps out in a northern english city police force. The show looks like it is shot in Manchester but it is called by another name in the show.  One episode is not on this disc the excellent 'prayer of the bone\" which is on a seperate disc.  Still crime shows don't get much better than this one on either side of the ocean.  It's just a great show that never has had a less than well made episode. Unfortunately like all British shows you only get about five shows a year ,  but these are an hour and a half shows , still one could hope for at least 8 of these a year.  The realism and depth of the main character Tony Hill as protrayed by the excellent Robson Green is well worth viewing because he just makes this role truly part of himself in everyway.  I bet he went to crime scenes even in real life to research his role.  But the writers too must be applauded for their way above average stories.  Lets hope this show continues on for many years to come.", "overall": 5.0, "summary": "Robson green and great writing", "unixReviewTime": 1234310400, "reviewTime": "02 11, 2009"}
{"reviewerID": "A1POFVVXUZR3IQ", "asin": "B000H00VBQ", "reviewerName": "Z Hayes", "helpful": [12, 12], "reviewText": "I discovered this series quite by accident. Having watched and appreciated Masterpiece Contemporary: Place of Execution, I was keen to read the novel (which inspired the TV adaptation) by Val McDermid. The novel was very well-written, and a nail-biting suspense thriller. Then I discovered that Val McDermid wrote other novels as well, and a couple of them inspired the TV crime drama Wire in the Blood.I finished watching all of Season 1 and have become a fan of this gritty crime drama that follows the investigations led by DI Carol Jordan (Hermione Norris). She is assisted by clinical psychologist Dr. Tony Hill (Robson Green), a rather eccentric figure who delves deeply into the minds of serial killers, studies patterns of criminal behavior and profiles criminals. His methods may seem strange at times, but he always manages to get results. Both Jordan and Hill make a strange if compelling pair, with Jordan analyzing a case based on evidence, and Hill working based on his knowledge of deviant behavior and what makes people commit disturbing crimes.Unlike some of the \"cozy\" mysteries such as the long-running Midsomer Murders - Set One and The Complete Inspector Lynley Mysteries, Wire in the Blood is not for the faint of heart. The crimes are horrific, sometimes involving children, almost always patterned on deviant behavior and the suspects are almost always very disturbed individuals. The crime scenes are difficult to watch as are the way victims are found and even the forensic examinations are graphic and unsettling. Though compelling, this is not really a show to watch in one sitting, and may very well give viewers nightmares.The first season contains three main stories, each divided into two episodes:The Mermaids Singing - Hill is on the trail of a seriously disturbed serial killer who targets homosexuals.Shadows Rising - The skeletal remains of a young woman is found, and when further evidence turns up, DI Jordan and Hill realize they have a serial killer on their hands, one with a penchant for dark-haired young women.Justice Painted Blind - Another unsettling case, this time revolving around an old child abduction and murder case. A couple of apparently random murders turn out not to be so random after all when it is discovered that the victims do share a connection involving an old court case where the accused was found not guilty. This throws up a whole bunch of suspects, including the parents of the murdered girl.The writing on this crime drama is excellent, and Robson Green is credible as the clinical psychologist who has a rare knack for profiling and getting under the skin of some of the most dangerous criminals. The drama also explores the chemistry and tension between Hill and DI Jordan, all of which result in a riveting show that keeps viewers coming back for more.The streaming was good overall with only a little delayed streaming during Episode One. There were no glitches on the other episodes. The picture quality could be improved though as it did seem a bit grainy to me.", "overall": 5.0, "summary": "I purchased the series via streaming and loved it!", "unixReviewTime": 1318291200, "reviewTime": "10 11, 2011"}
{"reviewerID": "A1PG2VV4W1WRPL", "asin": "B000H0X79O", "reviewerName": "Jimmy C. Saunders \"Papa Smurf\"", "helpful": [0, 0], "reviewText": "It beats watching a blank screen. However, I just don't seem to be in tune with to comedy of today.", "overall": 3.0, "summary": "It takes up your time.", "unixReviewTime": 1381795200, "reviewTime": "10 15, 2013"}
{"reviewerID": "ATASGS8HZHGIB", "asin": "B000H0X79O", "reviewerName": "JohnnyC", "helpful": [0, 0], "reviewText": "There are many episodes in this series, so I pretty-much just skip through them to try to find a description of something I think I would like.  It's kind of a crap shoot as to whether you'll be entertained or not, but hey, if you're just sitting around trying to kill 20-30 minutes while you're waiting for something else to do, it's worth a shot.", "overall": 3.0, "summary": "A reasonable way to kill a few minutes", "unixReviewTime": 1388275200, "reviewTime": "12 29, 2013"}
{"reviewerID": "A3RXD7Z44T9DHW", "asin": "B000H0X79O", "reviewerName": "Kansas", "helpful": [0, 0], "reviewText": "This is the best of the best comedy Stand-up. The fact that I was able to just watch continuously one comedian after another was great. I had the best laughter I have had in a long time.", "overall": 5.0, "summary": "kansas001", "unixReviewTime": 1393372800, "reviewTime": "02 26, 2014"}
{"reviewerID": "AUX8EUBNTHIIU", "asin": "B000H0X79O", "reviewerName": "Louis V. Borsellino", "helpful": [0, 0], "reviewText": "Not bad.  Didn't know any of the comedians but first time viewing put a smile on my face.  I'll check out the next season soon.", "overall": 3.0, "summary": "Entertaining Comedy", "unixReviewTime": 1396396800, "reviewTime": "04 2, 2014"}
{"reviewerID": "AXM3GQLD0CHIL", "asin": "B000H0X79O", "reviewerName": "Ray Shiva", "helpful": [0, 0], "reviewText": "Funny, interesting, a great way to pass time. I usually enjoy standup comedy and is this is a good show for me.", "overall": 4.0, "summary": "Worth watching!", "unixReviewTime": 1391731200, "reviewTime": "02 7, 2014"}
{"reviewerID": "A398QSASJOIKA6", "asin": "B000H29TXU", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I love the variety of comics.  Great for dinner TV entertainment because of length of each episode.  Many of the featured comics have gone on to even bigger TV specials so it's great to see some of their earlier material.", "overall": 4.0, "summary": "comedy club quality without leaving your home", "unixReviewTime": 1391644800, "reviewTime": "02 6, 2014"}
{"reviewerID": "A2U61O0KWJH3MM", "asin": "B000H29TXU", "reviewerName": "Cathy P.", "helpful": [0, 1], "reviewText": "comedy is a matter of taste. this guy was a little funny but there are others that are far funnier than this guy", "overall": 3.0, "summary": "ok", "unixReviewTime": 1378339200, "reviewTime": "09 5, 2013"}
{"reviewerID": "A2LSZFEFTDRDIJ", "asin": "B000H29TXU", "reviewerName": "debra marrero", "helpful": [0, 0], "reviewText": "if this had to do with Dat Phan, he was hilarious, I enjoyed his comedy and would watch him alone numerous times", "overall": 3.0, "summary": "not sure who this was for", "unixReviewTime": 1371168000, "reviewTime": "06 14, 2013"}
{"reviewerID": "A39F2EW27YYUDM", "asin": "B000H29TXU", "reviewerName": "Emily Booth", "helpful": [0, 0], "reviewText": "Watched it for Kevin Hart and only Kevin Hart!  He makes me laugh.  The best comedy comes from pain and Kevin does his comedy with a huge heart.", "overall": 5.0, "summary": "Loved it!", "unixReviewTime": 1398729600, "reviewTime": "04 29, 2014"}
{"reviewerID": "AO1Z63O9CTT95", "asin": "B000H29TXU", "reviewerName": "James Westervelt", "helpful": [0, 0], "reviewText": "he's OK. His humor consists mainly of varying between a Vietnamese accent and a smooth articulate presentation of ironic situations.", "overall": 2.0, "summary": "same routine he did on last comic standing", "unixReviewTime": 1394064000, "reviewTime": "03 6, 2014"}
{"reviewerID": "A1378ZJMWCTVT3", "asin": "B000H2DMME", "reviewerName": "Alla", "helpful": [0, 0], "reviewText": "some comedians are very good, some not so good, and some are just not funny.  I don't know the names to chose from and watched this by picking random episodes. However, I do know some big names in stand up comedy and these were not included on prime.", "overall": 3.0, "summary": "it was ok", "unixReviewTime": 1389225600, "reviewTime": "01 9, 2014"}
{"reviewerID": "A2JE0JYIZL5NU4", "asin": "B000H2DMME", "reviewerName": "C. A. Neal", "helpful": [0, 0], "reviewText": "I only watched the Wanda Sykes portion of this show. I think it was interesting to watch because it was before she came out as a lesbian. She was married to a man at the time. She actually made some jokes that raised my eyebrows since she is now a lesbian. I didn't like this because it seemed hypocritical but I think Wanda Sykes is really funny. She is one of the few comedians who can make me really LOL (Laugh Out Loud). If you want to see what her comedy was like before she came out a lesbian or you are a Wanda Sykes fan, watch it. I am a huge fan of hers. I would like to see her in a live how. I am glad she is true to herself now and came out as a lesbian. I hope Wanda keeps on making me and others laugh for a long time to come.", "overall": 3.0, "summary": "I Only Watched Wanda Sykes", "unixReviewTime": 1400371200, "reviewTime": "05 18, 2014"}
{"reviewerID": "A2LSZFEFTDRDIJ", "asin": "B000H2DMME", "reviewerName": "debra marrero", "helpful": [0, 0], "reviewText": "Enjoyed some of the comedians, it was a joy to laugh after losing my father whom I was a caregiver for", "overall": 5.0, "summary": "Some were funny", "unixReviewTime": 1360454400, "reviewTime": "02 10, 2013"}
{"reviewerID": "A3RXD7Z44T9DHW", "asin": "B000H2DMME", "reviewerName": "Kansas", "helpful": [0, 0], "reviewText": "All the comedians are hilarious. I have seen them all before on Comedy Central but what a great idea to put them all together. I love Amazon prime and I love their shows. They are so much better than Netflix. I got rid of my Netflix Amazon rocks and Netflix well it thymes with rocks but in a bad way.", "overall": 5.0, "summary": "kansas", "unixReviewTime": 1394064000, "reviewTime": "03 6, 2014"}
{"reviewerID": "AAWV26JJ1SGS0", "asin": "B000H2DMME", "reviewerName": "Margaret G. Louk \"loves music\"", "helpful": [0, 0], "reviewText": "There were some good entertainers, and some are just dumb.  I kept a paper and pen and wrote down names of the ones I wanted to see more.  They keep them in fairly short bits.  If you are looking to laugh continuous this may not be for you.  But each person has a different sense of humor so give it a try, but don't expect greatness.", "overall": 3.0, "summary": "Not something I want to watch over and over", "unixReviewTime": 1392249600, "reviewTime": "02 13, 2014"}
{"reviewerID": "AS2AMJR6JJZSS", "asin": "B000H2DMME", "reviewerName": "mari franks", "helpful": [0, 0], "reviewText": "Very funny. Some of the comedians were funnier than the others. We were laughing so hard the dog thought something was wrong with us", "overall": 5.0, "summary": "comedian clips", "unixReviewTime": 1391817600, "reviewTime": "02 8, 2014"}
{"reviewerID": "AXM3GQLD0CHIL", "asin": "B000H2DMME", "reviewerName": "Ray Shiva", "helpful": [0, 0], "reviewText": "Great variety of good comics. Each show is just the right length to not get boring. The comics are really funny too.", "overall": 5.0, "summary": "Excellent!", "unixReviewTime": 1366761600, "reviewTime": "04 24, 2013"}
{"reviewerID": "AYCGI5JRRISTJ", "asin": "B000H2DMME", "reviewerName": "Roger Keith Ing", "helpful": [0, 0], "reviewText": "I loved the humor of the stand-up comics featured here. I only got the free episode listed at the beginning of the season, but it probably gives a good idea of what is contained in the rest of the season. I have actually watched several episodes of this season when I was having a free 30-day trial membership in Amazon prime, which I eventually plan to become a paid subscriber to.", "overall": 5.0, "summary": "Very Funny", "unixReviewTime": 1362787200, "reviewTime": "03 9, 2013"}
{"reviewerID": "A1939G7K0LLQ8P", "asin": "B000H2DMME", "reviewerName": "Rugby", "helpful": [0, 0], "reviewText": "It was fine - not my favorite but a comic on her way up. Some of the same cliche material I hear from others but a spark if the individual world view comes to the fore.", "overall": 3.0, "summary": "A Matter of Preference", "unixReviewTime": 1333929600, "reviewTime": "04 9, 2012"}
{"reviewerID": "A2LUBUMIQEVWD3", "asin": "B000H2DMME", "reviewerName": "Tristan \"Tristan\"", "helpful": [0, 0], "reviewText": "It is nice to see some of the more popular comedians when they were first starting out. You can tell why some made it big and some didn't. If you like stand up comedy, I recommend giving it a try.", "overall": 3.0, "summary": "Pretty good but not great", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
{"reviewerID": "A3DG93E8TXMKZF", "asin": "B000H4YNM0", "reviewerName": "BytemanProofreader at Gmail \"JohnnyWill\"", "helpful": [1, 2], "reviewText": "This is a cute series, and I did watch two episodes, and enjoyed both of them.BUT I had to ask myself, if I had watched these two episodes on regular TV, would I have watched a third episode a week later? I had to honestly answer that I might watch it, but if something better was on, I wouldn't &#34;need&#34; to watch it.If you enjoy comedies, you might love this series more than me, and I might return to try it again in a few months or years. Sometimes, I return to a book at a later date and love it more, and the same could happen here.", "overall": 3.0, "summary": "an okay series, but I stopped watching after two episodes.", "unixReviewTime": 1395446400, "reviewTime": "03 22, 2014"}
{"reviewerID": "ALLV1OUJL3WN6", "asin": "B000H4YNM0", "reviewerName": "Chad A. Barts \"Chadillac\"", "helpful": [0, 0], "reviewText": "Season 2 of It's Always Sunny In Philadelphia is mandatory for anyhow who watches the show to own. This season has some of the greatest episodes in Sunny history!", "overall": 5.0, "summary": "Never a dull moment", "unixReviewTime": 1350604800, "reviewTime": "10 19, 2012"}
{"reviewerID": "A2MOIORZE53NL8", "asin": "B000H4YNM0", "reviewerName": "Consumer 45", "helpful": [0, 0], "reviewText": "Each episode gives me more entertainment than anything else on the tube. though I may not  want to have these characters as real friends - the women are hot though - the plots and characters make for great viewing.Do not see myself abandoning this series.I give 5 stars to every episode and season of Always Sunny in Philadelphia!Thanks Amazon!", "overall": 5.0, "summary": "The best underrated TV series ever!", "unixReviewTime": 1395446400, "reviewTime": "03 22, 2014"}
{"reviewerID": "ALZWY9L4E5GXO", "asin": "B000H4YNM0", "reviewerName": "Donna Smith", "helpful": [0, 0], "reviewText": "Got these for my son's birthday. He says they are great! They are funny so give them a try! OK!", "overall": 5.0, "summary": "It's always sunny 1 and 2", "unixReviewTime": 1373241600, "reviewTime": "07 8, 2013"}
{"reviewerID": "A2WDV8ACOG5LSA", "asin": "B000H4YNM0", "reviewerName": "Elisa Bohanan", "helpful": [0, 0], "reviewText": "The show is a little bit dry, but is definitely funny.Have only seen the first four episodes, and they were definitely funny enough to continue watching the series.Characters are easy to relate to as they are about my age, funny stuff.", "overall": 3.0, "summary": "Only 4 episodes in", "unixReviewTime": 1397520000, "reviewTime": "04 15, 2014"}
{"reviewerID": "ADJ9W8DJJKDJO", "asin": "B000H4YNM0", "reviewerName": "Erika Young", "helpful": [5, 14], "reviewText": "This show is plain dumb and not funny. It is sad how much TV comedy has deteriorated. Gone are the days of fantastic shows like Seinfeld, Cheers, Frasier, Everybody loves Raymond, Tool time etc. And they are replaces with shows like this one, with 2 dimensional stupid characters, bad acting and idiotic writing, where sleazy behavior is supposed to be funny. It is not!!!The 3 guys characters all have exactly the personality; all unlikeable, dumb, juvenile, infantile, sleazy and lack any redeeming qualities, and the girl is the same shallow personality in female version.The stories all have the same theme; juvenile pursuits of cheap thrills like one night stands (referred to as \"banging\") or getting quick cash without effort. And to get these thrills these 4 characters and even the father in season 2 are willing to do anything; \"banging\" the other guy's mom, selling alcohol to minors, threatening people with Jihad terror attacks, cheating the welfare system etc.The 4 characters plus the father are supposed to be business partners and friends, but all they ever do is screw each other over. With friends like these, who need enemies?YUK!!!!!!!!!!!!!!", "overall": 1.0, "summary": "DUMB, SLEAZY and NOT FUNNY", "unixReviewTime": 1375228800, "reviewTime": "07 31, 2013"}
{"reviewerID": "A3NFIJUVEAJGP", "asin": "B000H4YNM0", "reviewerName": "gary blakely", "helpful": [0, 5], "reviewText": "maybe i just dont get it...but crude not funny and irritating most of the time....guys that dumb shouldnt be on TV", "overall": 1.0, "summary": "this is just stupid", "unixReviewTime": 1398988800, "reviewTime": "05 2, 2014"}
{"reviewerID": "A2REG1E0F7XXJL", "asin": "B000H4YNM0", "reviewerName": "Grace11", "helpful": [0, 0], "reviewText": "Gave this to a good friend and ordered another for myself.  Very funny!  I highly recommend this for anyone who enjoys irony and a good laugh.", "overall": 5.0, "summary": "Great !", "unixReviewTime": 1370995200, "reviewTime": "06 12, 2013"}
{"reviewerID": "A1NF9WS7RR82MX", "asin": "B000H4YNM0", "reviewerName": "J. Hill", "helpful": [0, 0], "reviewText": "Out of all the new comedies that have come out in the last ten years, Sunny is as the top of my list.  You need an affinity for quirky, offbeat humor to enjoy it, not to mention a high tolerance for raw language and sexual humor.  The first season consisted of just seven episodes, but established the core characters and operators of Paddy&#8217;s Pub; owners Dennis, Mac, and Charlie, and waitress/Dennis&#8217;s twin sister Dee.  In Season 2 (ten episodes), Danny Devito comes on board as Frank, Dennis and Dee&#8217;s dad.  The show&#8217;s creators (Rob McElhenney/ Mac; Glenn Howerton/Dennis; and Charlie Day/Charlie) are hilarious as actors, and also as writers.  Every character on the show stands out and gets big laughs out of me.  It&#8217;s one of those great ensemble casts that&#8217;s incredibly balanced in terms of the personalities and comedic nature of each character, resulting in a consistently high level of quality in every episode.  These first two seasons have some of my favorites, including &#8220;Charlie Has Cancer,&#8221; &#8220;Charlie Got Molested,&#8221; &#8220;Dennis and Dee Go on Welfare,&#8221; &#8220;Hundred Dollar Baby,&#8221; and &#8220;Charlie Goes America All Over Everybody&#8217;s Ass.&#8221;  Like most fans of the show, I tend to favor the Charlie-themed episodes, and considering that he&#8217;s the only one so far to get movie roles and a gig hosting SNL, it&#8217;s clear how important he is as part of the cast.  But that&#8217;s not a knock against anyone else.  I can&#8217;t really imagine it continuing if they lost any of the key characters of Dennis, Dee, Mac, and Charlie, and even though Frank wasn't there in the beginning, it would definitley hurt the show to lose him.  As far as current TV comedies go, no one else is doing anything funnier than &#8220;Always Sunny,&#8221; and these first two seasons show it.", "overall": 5.0, "summary": "It's Always Funny in Philadelphia", "unixReviewTime": 1389139200, "reviewTime": "01 8, 2014"}
{"reviewerID": "AL6Q4IIX5MFQZ", "asin": "B000H4YNM0", "reviewerName": "John_in_NC", "helpful": [0, 0], "reviewText": "It's basically a slightly less intelligent version of &#34;Seinfeld.&#34; If I had to define it I'd say it's sophomoric humor which contains lots and lots of yelling amongst the main characters. For lovers of low brow comedy, this will be among your favorites. I haven't seen all of the episodes yet, but so far it appears that no topic is taboo.", "overall": 3.0, "summary": "It's Always Sunny in Philadelphia - Season 1", "unixReviewTime": 1398124800, "reviewTime": "04 22, 2014"}
{"reviewerID": "A356RFKNIG043B", "asin": "B000H4YNM0", "reviewerName": "K. Swanson", "helpful": [0, 0], "reviewText": "4.5 starsI knew nothing of this until a friend lent it to me this weekend. I laughed. Often. At things that aren't supposed to be funny, but as any serious fan of comedy knows, those can be the best laughs. I walked away feeling lighter and happier. If that ain't comedic success, what is?IASIP is like Seinfeld if the SeinFour were ten years younger, Irish, and ran a bar in South Philly. These guys have clearly studied Sein and Curb very closely, and their tight timing and topics and banter are all very Larry Davidesque...but they go places even LD won't. The best two shows of the 7-episode first season are about cancer and abortion; I howled at some moments. These guys have done what so many guys want to do: make a show about how funny they are. Except, these guys really are funny. Sometimes. But hey, no one's always hittin' homers, even on comedy 'roids, so I cut these three some slack and marvel at how tightly they work together. There's a lot to be said for working with old friends, if they have talent: the camaraderie and timing here are born of many years of drinking and laughing and thinking and falling down, no doubt. And these three guys are each pretty dang funny, each in his own fashion.DeVito is ok but I liked the first season best for its rawness. Still, as the later shows get a little more polished it's often in good ways.If you don't like drinking, if you insist on PC language from your friends and neighbors, and if you are in general just plain uptight about people living and thinking the way you want them to, look elsewhere. But If you enjoy tying one on and laughing your butt off at the endlessly silly idiocy that accompanies being alive in America these days, you may just find Always Sunny to be almost always funny.", "overall": 5.0, "summary": "It's Very Often Funny In Philly: occasionally hilarious in all the best wrong ways", "unixReviewTime": 1281225600, "reviewTime": "08 8, 2010"}
